load-tests/results/high-traffic-p95fix-finalcandidate-500x500/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m02.9s), 107/500 VUs, 393 complete and 0 interrupted iterations
high_traffic_booking   [  79% ] 500 VUs  00m00.7s/10m0s  393/500 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 1000    343.54658/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 500    171.77329/s
    reservations_created...............: 500    171.77329/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=346.48ms min=230.39ms med=309.69ms p(90)=513.51ms p(95)=552.62ms p(99)=616.8ms  max=622.51ms

    HTTP
    http_req_duration..................: avg=348.78ms min=218.75ms med=309.7ms  p(90)=517.19ms p(95)=555.32ms p(99)=617.03ms max=1.07s   
      { expected_response:true }.......: avg=348.78ms min=218.75ms med=309.7ms  p(90)=517.19ms p(95)=555.32ms p(99)=617.03ms max=1.07s   
    http_req_failed....................: 0.00%  0 out of 503
    http_reqs..........................: 503    172.80393/s

    EXECUTION
    iteration_duration.................: avg=403.35ms min=248.96ms med=348.77ms p(90)=614.03ms p(95)=640.38ms p(99)=702.97ms max=712.46ms
    iterations.........................: 500    171.77329/s
    vus................................: 107    min=0        max=107
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 386 kB 133 kB/s
    data_sent..........................: 294 kB 101 kB/s



running (00m02.9s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m00.7s/10m0s  500/500 shared iters